[NoCoverage] BlockStatement
src/library.ts:720:22
-       if (trade.item2) {
-           return processDirectTradeWithItem2(trade, baseCurrency, values);
-       }
+       if (trade.item2) {}

[NoCoverage] BlockStatement
src/library.ts:768:22
-       if (trade.item2) {
-           return deriveTransitiveValueWithItem2(trade, baseCurrency, values);
-       }
+       if (trade.item2) {}

[Survived] BlockStatement
src/library.ts:867:37
-           for (const trade of trades) {
-               if (deriveTransitiveValue(trade, baseCurrency, values)) {
-                   changed = true;
-               }
-           }
+           for (const trade of trades) {}
Tests ran:
    calculateItemValues calculates buy prices from emerald trades
    calculateItemValues calculates sell prices
    calculateItemValues handles emerald block as 9 emeralds

[Survived] ConditionalExpression
src/library.ts:868:17
-               if (deriveTransitiveValue(trade, baseCurrency, values)) {
+               if (true) {
Tests ran:
    calculateItemValues calculates buy prices from emerald trades
    calculateItemValues calculates sell prices
    calculateItemValues handles emerald block as 9 emeralds

[Survived] ConditionalExpression
src/library.ts:868:17
-               if (deriveTransitiveValue(trade, baseCurrency, values)) {
+               if (false) {
Tests ran:
    calculateItemValues calculates buy prices from emerald trades
    calculateItemValues calculates sell prices
    calculateItemValues handles emerald block as 9 emeralds

[NoCoverage] BlockStatement
src/library.ts:868:69
-               if (deriveTransitiveValue(trade, baseCurrency, values)) {
-                   changed = true;
-               }
+               if (deriveTransitiveValue(trade, baseCurrency, values)) {}
