[Survived] BlockStatement
src/library.ts:108:31
-       if (cached !== undefined) { return cached; }
+       if (cached !== undefined) {}
Tests ran:
    matchesQuery properties never throws on arbitrary unicode input
    matchesQuery properties empty query matches everything
    matchesQuery properties text always matches itself
  and 12 more tests!

[Survived] StringLiteral
src/library.ts:109:33
-       const result = s.replaceAll('_', ' ').replaceAll(' ', '');
+       const result = s.replaceAll("", ' ').replaceAll(' ', '');
Tests ran:
    matchesQuery properties never throws on arbitrary unicode input
    matchesQuery properties empty query matches everything
    matchesQuery properties text always matches itself
  and 11 more tests!

[Survived] StringLiteral
src/library.ts:109:38
-       const result = s.replaceAll('_', ' ').replaceAll(' ', '');
+       const result = s.replaceAll('_', "").replaceAll(' ', '');
Tests ran:
    matchesQuery properties never throws on arbitrary unicode input
    matchesQuery properties empty query matches everything
    matchesQuery properties text always matches itself
  and 11 more tests!

[Survived] MethodExpression
src/library.ts:133:19
-       const words = query.replaceAll('_', ' ').split(/\s+/).filter(Boolean);
+       const words = query.replaceAll('_', ' ').split(/\s+/);
Tests ran:
    matchesQuery properties never throws on arbitrary unicode input
    matchesQuery words in any order
    matchesQuery no match returns false
  and 2 more tests!

[Survived] StringLiteral
src/library.ts:133:36
-       const words = query.replaceAll('_', ' ').split(/\s+/).filter(Boolean);
+       const words = query.replaceAll("", ' ').split(/\s+/).filter(Boolean);
Tests ran:
    matchesQuery properties never throws on arbitrary unicode input
    matchesQuery words in any order
    matchesQuery no match returns false
  and 2 more tests!

[Survived] StringLiteral
src/library.ts:133:41
-       const words = query.replaceAll('_', ' ').split(/\s+/).filter(Boolean);
+       const words = query.replaceAll('_', "").split(/\s+/).filter(Boolean);
Tests ran:
    matchesQuery properties never throws on arbitrary unicode input
    matchesQuery words in any order
    matchesQuery no match returns false
  and 2 more tests!

[Survived] Regex
src/library.ts:133:52
-       const words = query.replaceAll('_', ' ').split(/\s+/).filter(Boolean);
+       const words = query.replaceAll('_', ' ').split(/\s/).filter(Boolean);
Tests ran:
    matchesQuery properties never throws on arbitrary unicode input
    matchesQuery words in any order
    matchesQuery no match returns false
  and 2 more tests!

[Survived] MethodExpression
src/library.ts:134:12
-       return words.every(word => textLower.includes(word.toLowerCase()));
+       return words.some(word => textLower.includes(word.toLowerCase()));
Tests ran:
    matchesQuery properties never throws on arbitrary unicode input
    matchesQuery words in any order
    matchesQuery no match returns false
  and 2 more tests!

[Survived] ConditionalExpression
src/library.ts:177:9
-       if (!text) { return ''; }
+       if (false) { return ''; }
Tests ran:
    formatName properties output starts with uppercase letter
    formatName properties underscores are converted to spaces
    formatName uses item name if present
  and 10 more tests!

[Survived] BlockStatement
src/library.ts:177:16
-       if (!text) { return ''; }
+       if (!text) {}
Tests ran:
    formatName handles empty name and type

[Survived] ConditionalExpression
src/library.ts:200:13
-           if (rule.item !== type) { continue; }
+           if (false) { continue; }
Tests ran:
    applyMapping maps vote diamond correctly
    applyMapping does not map without matching enchant
    applyMapping does not map without matching name
  and 2 more tests!

[Survived] BlockStatement
src/library.ts:200:33
-           if (rule.item !== type) { continue; }
+           if (rule.item !== type) {}
Tests ran:
    processTrade applies mapping rules

[Survived] EqualityOperator
src/library.ts:241:12
-       while (index < string_.length) {
+       while (index <= string_.length) {
Tests ran:
    getRegex properties never throws on any string input
    getRegex properties returned regex matches the original query
    getRegex properties wildcard * matches any characters
  and 9 more tests!

[Survived] ConditionalExpression
src/library.ts:242:40
-           if (string_[index] === '\\' && index + 1 < string_.length) {
+           if (string_[index] === '\\' && true) {
Tests ran:
    getRegex properties never throws on any string input
    getRegex handles regex special chars without throwing
    getRegex matches text containing special regex chars
  and 2 more tests!

[Survived] EqualityOperator
src/library.ts:242:40
-           if (string_[index] === '\\' && index + 1 < string_.length) {
+           if (string_[index] === '\\' && index + 1 <= string_.length) {
Tests ran:
    getRegex properties never throws on any string input
    getRegex handles regex special chars without throwing
    getRegex matches text containing special regex chars
  and 2 more tests!

[Survived] ArithmeticOperator
src/library.ts:242:40
-           if (string_[index] === '\\' && index + 1 < string_.length) {
+           if (string_[index] === '\\' && index - 1 < string_.length) {
Tests ran:
    getRegex properties never throws on any string input
    getRegex handles regex special chars without throwing
    getRegex matches text containing special regex chars
  and 2 more tests!

[Survived] Regex
src/library.ts:270:26
-       const shulkerRegex = /-\s*(\d+)x\s+(.+)/i;
+       const shulkerRegex = /-\s(\d+)x\s+(.+)/i;
Tests ran:
    parseShulkerContents parses single item type
    parseShulkerContents parses mixed items and returns most common
    parseShulkerContents includes minority items for search
  and 3 more tests!

[Survived] Regex
src/library.ts:270:26
-       const shulkerRegex = /-\s*(\d+)x\s+(.+)/i;
+       const shulkerRegex = /-\s*(\d+)x\s(.+)/i;
Tests ran:
    parseShulkerContents parses single item type
    parseShulkerContents parses mixed items and returns most common
    parseShulkerContents includes minority items for search
  and 3 more tests!

[Survived] MethodExpression
src/library.ts:275:26
-               const item = match[2].trim();
+               const item = match[2];
Tests ran:
    parseShulkerContents parses single item type
    parseShulkerContents parses mixed items and returns most common
    parseShulkerContents includes minority items for search
  and 2 more tests!

[Survived] MethodExpression
src/library.ts:289:5
-       items.sort((a, b) => b.total - a.total);
+       items;
Tests ran:
    parseShulkerContents parses single item type
    parseShulkerContents parses mixed items and returns most common
    parseShulkerContents includes minority items for search
  and 3 more tests!

[Survived] ArithmeticOperator
src/library.ts:289:26
-       items.sort((a, b) => b.total - a.total);
+       items.sort((a, b) => b.total + a.total);
Tests ran:
    parseShulkerContents parses mixed items and returns most common
    parseShulkerContents includes minority items for search

[NoCoverage] StringLiteral
src/library.ts:356:43
-           x: Number.parseFloat(coords[0] ?? '0') || 0,
+           x: Number.parseFloat(coords[0] ?? "") || 0,

[Survived] StringLiteral
src/library.ts:357:43
-           y: Number.parseFloat(coords[1] ?? '0') || 0,
+           y: Number.parseFloat(coords[1] ?? "") || 0,
Tests ran:
    parseLocation properties never throws on malformed input
    parseLocation handles missing values

[Survived] StringLiteral
src/library.ts:358:43
-           z: Number.parseFloat(coords[2] ?? '0') || 0
+           z: Number.parseFloat(coords[2] ?? "") || 0
Tests ran:
    parseLocation properties never throws on malformed input
    parseLocation handles missing values

[Survived] StringLiteral
src/library.ts:381:38
-       const world = shop.world.replace('minecraft:', '');
+       const world = shop.world.replace("", '');
Tests ran:
    processTrade processes basic trade
    processTrade applies mapping rules
    processTrade processes shulker trade

[Survived] StringLiteral
src/library.ts:381:52
-       const world = shop.world.replace('minecraft:', '');
+       const world = shop.world.replace('minecraft:', "Stryker was here!");
Tests ran:
    processTrade processes basic trade
    processTrade applies mapping rules
    processTrade processes shulker trade

[Survived] ConditionalExpression
src/library.ts:385:9
-       if (recipe.item2) { applyMapping(recipe.item2, mappingRules); }
+       if (true) { applyMapping(recipe.item2, mappingRules); }
Tests ran:
    processTrade processes basic trade
    processTrade applies mapping rules
    processTrade processes shulker trade

[Survived] ConditionalExpression
src/library.ts:385:9
-       if (recipe.item2) { applyMapping(recipe.item2, mappingRules); }
+       if (false) { applyMapping(recipe.item2, mappingRules); }
Tests ran:
    processTrade processes basic trade
    processTrade applies mapping rules
    processTrade processes shulker trade

[NoCoverage] BlockStatement
src/library.ts:385:23
-       if (recipe.item2) { applyMapping(recipe.item2, mappingRules); }
+       if (recipe.item2) {}

[Survived] ArrayDeclaration
src/library.ts:387:44
-       const lore = recipe.resultItem.lore || [];
+       const lore = recipe.resultItem.lore || ["Stryker was here"];
Tests ran:
    processTrade processes basic trade
    processTrade applies mapping rules

[Survived] StringLiteral
src/library.ts:390:20
-       let loreText = '';
+       let loreText = "Stryker was here!";
Tests ran:
    processTrade processes basic trade
    processTrade applies mapping rules
    processTrade processes shulker trade

[Survived] BooleanLiteral
src/library.ts:391:21
-       let isShulker = false;
+       let isShulker = true;
Tests ran:
    processTrade processes basic trade
    processTrade applies mapping rules
    processTrade processes shulker trade

[Survived] LogicalOperator
src/library.ts:394:9
-       if (lore.length > 0 && recipe.resultItem.type.includes('SHULKER')) {
+       if (lore.length > 0 || recipe.resultItem.type.includes('SHULKER')) {
Tests ran:
    processTrade processes basic trade
    processTrade applies mapping rules
    processTrade processes shulker trade

[Survived] ConditionalExpression
src/library.ts:394:9
-       if (lore.length > 0 && recipe.resultItem.type.includes('SHULKER')) {
+       if (true && recipe.resultItem.type.includes('SHULKER')) {
Tests ran:
    processTrade processes basic trade
    processTrade applies mapping rules
    processTrade processes shulker trade

[Survived] EqualityOperator
src/library.ts:394:9
-       if (lore.length > 0 && recipe.resultItem.type.includes('SHULKER')) {
+       if (lore.length >= 0 && recipe.resultItem.type.includes('SHULKER')) {
Tests ran:
    processTrade processes basic trade
    processTrade applies mapping rules
    processTrade processes shulker trade

[Survived] StringLiteral
src/library.ts:394:60
-       if (lore.length > 0 && recipe.resultItem.type.includes('SHULKER')) {
+       if (lore.length > 0 && recipe.resultItem.type.includes("")) {
Tests ran:
    processTrade processes shulker trade

[Survived] MethodExpression
src/library.ts:399:20
-           loreText = lore.join(' ').toLowerCase();
+           loreText = lore.join(' ').toUpperCase();
Tests ran:
    processTrade processes shulker trade

[Survived] StringLiteral
src/library.ts:399:30
-           loreText = lore.join(' ').toLowerCase();
+           loreText = lore.join("").toLowerCase();
Tests ran:
    processTrade processes shulker trade

[NoCoverage] StringLiteral
src/library.ts:406:65
-       const costName = formatName(recipe.item1) + (recipe.item2 ? ' ' + formatName(recipe.item2) : '');
+       const costName = formatName(recipe.item1) + (recipe.item2 ? "" + formatName(recipe.item2) : '');

[Survived] MethodExpression
src/library.ts:416:21
-           resultText: resultName.toLowerCase(),
+           resultText: resultName.toUpperCase(),
Tests ran:
    processTrade processes basic trade
    processTrade applies mapping rules
    processTrade processes shulker trade

[Survived] MethodExpression
src/library.ts:417:19
-           costText: costName.toLowerCase(),
+           costText: costName.toUpperCase(),
Tests ran:
    processTrade processes basic trade
    processTrade applies mapping rules
    processTrade processes shulker trade

[Survived] ConditionalExpression
src/library.ts:442:9
-           matchesQuery(item.key, query) || matchesQuery(item.name.toLowerCase(), query)
+           true
Tests ran:
    filterTrade matches shulker contents

[Survived] LogicalOperator
src/library.ts:442:9
-           matchesQuery(item.key, query) || matchesQuery(item.name.toLowerCase(), query)
+           matchesQuery(item.key, query) && matchesQuery(item.name.toLowerCase(), query)
Tests ran:
    filterTrade matches shulker contents

[NoCoverage] MethodExpression
src/library.ts:442:55
-           matchesQuery(item.key, query) || matchesQuery(item.name.toLowerCase(), query)
+           matchesQuery(item.key, query) || matchesQuery(item.name.toUpperCase(), query)

[Survived] BooleanLiteral
src/library.ts:445:27
-           return { matched: true, name: matched.name, amount: matched.total };
+           return { matched: false, name: matched.name, amount: matched.total };
Tests ran:
    filterTrade matches shulker contents

[Survived] ConditionalExpression
src/library.ts:454:9
-       if (!wantQuery) {
+       if (false) {
Tests ran:
    filterTrade properties empty queries match all non-zero stock trades
    filterTrade properties exact case match returns defined result
    filterTrade matches by result text
  and 4 more tests!

[Survived] BlockStatement
src/library.ts:454:21
-       if (!wantQuery) {
-           return { matchResult: true, displayName: trade.resultName, displayAmount: trade.resultAmount };
-       }
+       if (!wantQuery) {}
Tests ran:
    filterTrade properties empty queries match all non-zero stock trades
    filterTrade matches by cost text
    filterTrade returns match when no queries provided

[Survived] BooleanLiteral
src/library.ts:455:31
-           return { matchResult: true, displayName: trade.resultName, displayAmount: trade.resultAmount };
+           return { matchResult: false, displayName: trade.resultName, displayAmount: trade.resultAmount };
Tests ran:
    filterTrade properties empty queries match all non-zero stock trades
    filterTrade matches by cost text
    filterTrade returns match when no queries provided

[Survived] BooleanLiteral
src/library.ts:484:77
-       const matchCost = giveQuery ? matchesQuery(trade.costText, giveQuery) : true;
+       const matchCost = giveQuery ? matchesQuery(trade.costText, giveQuery) : false;
Tests ran:
    filterTrade properties empty queries match all non-zero stock trades
    filterTrade properties exact case match returns defined result
    filterTrade matches by result text
  and 3 more tests!

[Survived] ConditionalExpression
src/library.ts:487:9
-       if (giveQuery && !matchCost) { return undefined; }
+       if (false) { return undefined; }
Tests ran:
    filterTrade properties empty queries match all non-zero stock trades
    filterTrade properties exact case match returns defined result
    filterTrade matches by result text
  and 3 more tests!

[NoCoverage] BlockStatement
src/library.ts:487:34
-       if (giveQuery && !matchCost) { return undefined; }
+       if (giveQuery && !matchCost) {}

[Survived] ConditionalExpression
src/library.ts:528:13
-               case 'cost-amt': {
-                   valueA = tradeA.item1.amount + (tradeA.item2?.amount || 0);
-                   valueB = tradeB.item1.amount + (tradeB.item2?.amount || 0);
-                   break;
-               }
+               case 'cost-amt':
Tests ran:
    sortResults properties length is preserved after sort
    sortResults properties same elements after sort

[Survived] ArithmeticOperator
src/library.ts:529:26
-                   valueA = tradeA.item1.amount + (tradeA.item2?.amount || 0);
+                   valueA = tradeA.item1.amount - (tradeA.item2?.amount || 0);
Tests ran:
    sortResults properties length is preserved after sort
    sortResults properties same elements after sort

[Survived] ArithmeticOperator
src/library.ts:530:26
-                   valueB = tradeB.item1.amount + (tradeB.item2?.amount || 0);
+                   valueB = tradeB.item1.amount - (tradeB.item2?.amount || 0);
Tests ran:
    sortResults properties length is preserved after sort
    sortResults properties same elements after sort

[NoCoverage] ConditionalExpression
src/library.ts:533:13
-               case 'cost-name': {
-                   return sortDirection * tradeA.costName.localeCompare(tradeB.costName);
-               }
+               case 'cost-name':

[NoCoverage] ArithmeticOperator
src/library.ts:534:24
-                   return sortDirection * tradeA.costName.localeCompare(tradeB.costName);
+                   return sortDirection / tradeA.costName.localeCompare(tradeB.costName);

[Survived] ArithmeticOperator
src/library.ts:542:24
-                   return sortDirection * tradeA.resultName.localeCompare(tradeB.resultName);
+                   return sortDirection / tradeA.resultName.localeCompare(tradeB.resultName);
Tests ran:
    sortResults sorts by result-name ascending

[Survived] ConditionalExpression
src/library.ts:544:13
-               case 'stock': {
-                   valueA = tradeA.displayStock;
-                   valueB = tradeB.displayStock;
-                   break;
-               }
+               case 'stock':
Tests ran:
    sortResults properties length is preserved after sort
    sortResults properties same elements after sort

[Survived] ArithmeticOperator
src/library.ts:550:24
-                   return sortDirection * tradeA.world.localeCompare(tradeB.world);
+                   return sortDirection / tradeA.world.localeCompare(tradeB.world);
Tests ran:
    sortResults sorts by world ascending

[Survived] ArithmeticOperator
src/library.ts:561:16
-           return sortDirection * (valueA - valueB);
+           return sortDirection / (valueA - valueB);
Tests ran:
    sortResults properties length is preserved after sort
    sortResults properties same elements after sort
    sortResults sorts by result-amt descending
  and 3 more tests!

[Survived] ConditionalExpression
src/library.ts:572:9
-       if (!Number.isFinite(ratio) || ratio <= 0) { return; }
+       if (false) { return; }
Tests ran:
    buildRatioGraph and getRatio builds ratio graph from item values

[Survived] LogicalOperator
src/library.ts:572:9
-       if (!Number.isFinite(ratio) || ratio <= 0) { return; }
+       if (!Number.isFinite(ratio) && ratio <= 0) { return; }
Tests ran:
    buildRatioGraph and getRatio builds ratio graph from item values

[Survived] ConditionalExpression
src/library.ts:572:36
-       if (!Number.isFinite(ratio) || ratio <= 0) { return; }
+       if (!Number.isFinite(ratio) || false) { return; }
Tests ran:
    buildRatioGraph and getRatio builds ratio graph from item values

[Survived] EqualityOperator
src/library.ts:572:36
-       if (!Number.isFinite(ratio) || ratio <= 0) { return; }
+       if (!Number.isFinite(ratio) || ratio < 0) { return; }
Tests ran:
    buildRatioGraph and getRatio builds ratio graph from item values

[NoCoverage] BlockStatement
src/library.ts:572:48
-       if (!Number.isFinite(ratio) || ratio <= 0) { return; }
+       if (!Number.isFinite(ratio) || ratio <= 0) {}

[Survived] MethodExpression
src/library.ts:573:20
-       const key = `${from.toLowerCase()}->${to.toLowerCase()}`;
+       const key = `${from.toUpperCase()}->${to.toLowerCase()}`;
Tests ran:
    buildRatioGraph and getRatio builds ratio graph from item values

[Survived] MethodExpression
src/library.ts:573:43
-       const key = `${from.toLowerCase()}->${to.toLowerCase()}`;
+       const key = `${from.toLowerCase()}->${to.toUpperCase()}`;
Tests ran:
    buildRatioGraph and getRatio builds ratio graph from item values

[Survived] StringLiteral
src/library.ts:574:24
-       const reverseKey = `${to.toLowerCase()}->${from.toLowerCase()}`;
+       const reverseKey = ``;
Tests ran:
    buildRatioGraph and getRatio builds ratio graph from item values

[Survived] MethodExpression
src/library.ts:574:27
-       const reverseKey = `${to.toLowerCase()}->${from.toLowerCase()}`;
+       const reverseKey = `${to.toUpperCase()}->${from.toLowerCase()}`;
Tests ran:
    buildRatioGraph and getRatio builds ratio graph from item values

[Survived] MethodExpression
src/library.ts:574:48
-       const reverseKey = `${to.toLowerCase()}->${from.toLowerCase()}`;
+       const reverseKey = `${to.toLowerCase()}->${from.toUpperCase()}`;
Tests ran:
    buildRatioGraph and getRatio builds ratio graph from item values

[Survived] ConditionalExpression
src/library.ts:576:9
-       if (!graph.has(key)) {
+       if (true) {
Tests ran:
    buildRatioGraph and getRatio builds ratio graph from item values

[Survived] ArithmeticOperator
src/library.ts:578:31
-           graph.set(reverseKey, 1 / ratio);
+           graph.set(reverseKey, 1 * ratio);
Tests ran:
    buildRatioGraph and getRatio builds ratio graph from item values

[NoCoverage] ArithmeticOperator
src/library.ts:589:15
-               ? (medianBuy + medianSell) / 2
+               ? (medianBuy + medianSell) * 2

[NoCoverage] ArithmeticOperator
src/library.ts:589:16
-               ? (medianBuy + medianSell) / 2
+               ? (medianBuy - medianSell) / 2

[Survived] StringLiteral
src/library.ts:596:23
-       emeraldValues.set('emerald', 1);
+       emeraldValues.set("", 1);
Tests ran:
    buildRatioGraph and getRatio builds ratio graph from item values
    buildRatioGraph and getRatio returns null for unknown ratio

[Survived] ArithmeticOperator
src/library.ts:607:56
-               emeraldValues.set(blockName.toLowerCase(), baseValue * multiplier);
+               emeraldValues.set(blockName.toLowerCase(), baseValue / multiplier);
Tests ran:
    buildRatioGraph and getRatio builds ratio graph from item values
    buildRatioGraph and getRatio returns null for unknown ratio

[Survived] ConditionalExpression
src/library.ts:622:17
-               if (blockA === blockB) { continue; }
+               if (false) { continue; }
Tests ran:
    buildRatioGraph and getRatio builds ratio graph from item values
    buildRatioGraph and getRatio returns null for unknown ratio

[Survived] BlockStatement
src/library.ts:622:36
-               if (blockA === blockB) { continue; }
+               if (blockA === blockB) {}
Tests ran:
    buildRatioGraph and getRatio builds ratio graph from item values
    buildRatioGraph and getRatio returns null for unknown ratio

[Survived] ConditionalExpression
src/library.ts:678:22
-       if (blockInfo && blockInfo.base.toLowerCase() === baseNorm) {
+       if (blockInfo && true) {
Tests ran:
    calculateItemValues handles emerald block as 9 emeralds

[NoCoverage] ConditionalExpression
src/library.ts:684:26
-       if (baseBlockInfo && baseBlockInfo.base.toLowerCase() === itemNorm) {
+       if (baseBlockInfo && true) {

[NoCoverage] EqualityOperator
src/library.ts:684:26
-       if (baseBlockInfo && baseBlockInfo.base.toLowerCase() === itemNorm) {
+       if (baseBlockInfo && baseBlockInfo.base.toLowerCase() !== itemNorm) {

[NoCoverage] MethodExpression
src/library.ts:684:26
-       if (baseBlockInfo && baseBlockInfo.base.toLowerCase() === itemNorm) {
+       if (baseBlockInfo && baseBlockInfo.base.toUpperCase() === itemNorm) {

[NoCoverage] BlockStatement
src/library.ts:684:73
-       if (baseBlockInfo && baseBlockInfo.base.toLowerCase() === itemNorm) {
-           return { matches: true, amount: amount / baseBlockInfo.multiplier };
-       }
+       if (baseBlockInfo && baseBlockInfo.base.toLowerCase() === itemNorm) {}

[NoCoverage] BooleanLiteral
src/library.ts:685:27
-           return { matches: true, amount: amount / baseBlockInfo.multiplier };
+           return { matches: false, amount: amount / baseBlockInfo.multiplier };

[NoCoverage] ArithmeticOperator
src/library.ts:685:41
-           return { matches: true, amount: amount / baseBlockInfo.multiplier };
+           return { matches: true, amount: amount * baseBlockInfo.multiplier };

[Survived] ConditionalExpression
src/library.ts:702:9
-       if (!values.has(key)) {
+       if (true) {
Tests ran:
    calculateItemValues calculates buy prices from emerald trades
    calculateItemValues calculates sell prices
    calculateItemValues handles emerald block as 9 emeralds

[Survived] ConditionalExpression
src/library.ts:720:9
-       if (trade.item2) {
+       if (false) {
Tests ran:
    calculateItemValues calculates buy prices from emerald trades
    calculateItemValues calculates sell prices
    calculateItemValues handles emerald block as 9 emeralds

[Survived] LogicalOperator
src/library.ts:724:23
-       const item1Name = trade.item1Name ?? trade.costName;
+       const item1Name = trade.item1Name && trade.costName;
Tests ran:
    calculateItemValues calculates buy prices from emerald trades
    calculateItemValues calculates sell prices
    calculateItemValues handles emerald block as 9 emeralds

[Survived] ConditionalExpression
src/library.ts:728:9
-       if (costAsBase.matches === resultAsBase.matches) { return; }
+       if (false) { return; }
Tests ran:
    calculateItemValues calculates buy prices from emerald trades
    calculateItemValues calculates sell prices
    calculateItemValues handles emerald block as 9 emeralds

[NoCoverage] BlockStatement
src/library.ts:728:54
-       if (costAsBase.matches === resultAsBase.matches) { return; }
+       if (costAsBase.matches === resultAsBase.matches) {}

[Survived] ConditionalExpression
src/library.ts:733:16
-       } else if (resultAsBase.matches) {
+       } else if (true) {
Tests ran:
    calculateItemValues calculates sell prices

[NoCoverage] BlockStatement
src/library.ts:743:9
-   ): void {
-       if (!trade.item2) { return; }
-       const item1Name = trade.item1Name ?? trade.costName;
-       const item2Name = formatName(trade.item2);
-       
-       const item1AsBase = normalizeToBaseCurrency(item1Name, trade.costAmount, baseCurrency);
-       const item2AsBase = normalizeToBaseCurrency(item2Name, trade.item2.amount, baseCurrency);
-       const resultAsBase = normalizeToBaseCurrency(trade.resultName, trade.resultAmount, baseCurrency);
-       // Both inputs are base currency -> derive result value
-       if (item1AsBase.matches && item2AsBase.matches && !resultAsBase.matches) {
-           const totalCost = item1AsBase.amount + item2AsBase.amount;
-           const pricePerItem = totalCost / trade.resultAmount;
-           addValue(values, trade.resultName, pricePerItem, 'buy', trade.x, trade.y, trade.z);
-       }
-       // Result is base currency, both inputs are not -> can't derive individual values
-   }
+   ): void {}

[NoCoverage] LogicalOperator
src/library.ts:746:23
-       const item1Name = trade.item1Name ?? trade.costName;
+       const item1Name = trade.item1Name && trade.costName;

[NoCoverage] ConditionalExpression
src/library.ts:754:9
-       if (item1AsBase.matches && item2AsBase.matches && !resultAsBase.matches) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/library.ts:754:9
-       if (item1AsBase.matches && item2AsBase.matches && !resultAsBase.matches) {
+       if (false) {

[NoCoverage] LogicalOperator
src/library.ts:754:9
-       if (item1AsBase.matches && item2AsBase.matches && !resultAsBase.matches) {
+       if (item1AsBase.matches && item2AsBase.matches || !resultAsBase.matches) {

[NoCoverage] ConditionalExpression
src/library.ts:754:9
-       if (item1AsBase.matches && item2AsBase.matches && !resultAsBase.matches) {
+       if (true && !resultAsBase.matches) {

[NoCoverage] LogicalOperator
src/library.ts:754:9
-       if (item1AsBase.matches && item2AsBase.matches && !resultAsBase.matches) {
+       if (item1AsBase.matches || item2AsBase.matches && !resultAsBase.matches) {

[NoCoverage] BooleanLiteral
src/library.ts:754:55
-       if (item1AsBase.matches && item2AsBase.matches && !resultAsBase.matches) {
+       if (item1AsBase.matches && item2AsBase.matches && resultAsBase.matches) {

[NoCoverage] BlockStatement
src/library.ts:754:78
-       if (item1AsBase.matches && item2AsBase.matches && !resultAsBase.matches) {
-           const totalCost = item1AsBase.amount + item2AsBase.amount;
-           const pricePerItem = totalCost / trade.resultAmount;
-           addValue(values, trade.resultName, pricePerItem, 'buy', trade.x, trade.y, trade.z);
-       }
+       if (item1AsBase.matches && item2AsBase.matches && !resultAsBase.matches) {}

[NoCoverage] ArithmeticOperator
src/library.ts:755:27
-           const totalCost = item1AsBase.amount + item2AsBase.amount;
+           const totalCost = item1AsBase.amount - item2AsBase.amount;

[NoCoverage] ArithmeticOperator
src/library.ts:756:30
-           const pricePerItem = totalCost / trade.resultAmount;
+           const pricePerItem = totalCost * trade.resultAmount;

[Survived] ConditionalExpression
src/library.ts:768:9
-       if (trade.item2) {
+       if (false) {
Tests ran:
    calculateItemValues calculates buy prices from emerald trades
    calculateItemValues calculates sell prices
    calculateItemValues handles emerald block as 9 emeralds

[Survived] LogicalOperator
src/library.ts:772:23
-       const item1Name = trade.item1Name ?? trade.costName;
+       const item1Name = trade.item1Name && trade.costName;
Tests ran:
    calculateItemValues calculates buy prices from emerald trades
    calculateItemValues calculates sell prices
    calculateItemValues handles emerald block as 9 emeralds
