[Survived] MethodExpression
src/library.ts:773:21
-       const costKey = item1Name.toLowerCase();
+       const costKey = item1Name.toUpperCase();
Tests ran:
    calculateItemValues calculates buy prices from emerald trades
    calculateItemValues calculates sell prices
    calculateItemValues handles emerald block as 9 emeralds

[Survived] MethodExpression
src/library.ts:774:23
-       const resultKey = trade.resultName.toLowerCase();
+       const resultKey = trade.resultName.toUpperCase();
Tests ran:
    calculateItemValues calculates buy prices from emerald trades
    calculateItemValues calculates sell prices
    calculateItemValues handles emerald block as 9 emeralds

[Survived] ConditionalExpression
src/library.ts:778:9
-       if (costIsBase || resultIsBase) { return false; }
+       if (false) { return false; }
Tests ran:
    calculateItemValues calculates buy prices from emerald trades
    calculateItemValues calculates sell prices
    calculateItemValues handles emerald block as 9 emeralds

[Survived] LogicalOperator
src/library.ts:778:9
-       if (costIsBase || resultIsBase) { return false; }
+       if (costIsBase && resultIsBase) { return false; }
Tests ran:
    calculateItemValues calculates buy prices from emerald trades
    calculateItemValues calculates sell prices
    calculateItemValues handles emerald block as 9 emeralds

[Survived] BlockStatement
src/library.ts:778:37
-       if (costIsBase || resultIsBase) { return false; }
+       if (costIsBase || resultIsBase) {}
Tests ran:
    calculateItemValues calculates buy prices from emerald trades
    calculateItemValues calculates sell prices
    calculateItemValues handles emerald block as 9 emeralds

[Survived] BooleanLiteral
src/library.ts:778:46
-       if (costIsBase || resultIsBase) { return false; }
+       if (costIsBase || resultIsBase) { return true; }
Tests ran:
    calculateItemValues calculates buy prices from emerald trades
    calculateItemValues calculates sell prices
    calculateItemValues handles emerald block as 9 emeralds

[NoCoverage] BooleanLiteral
src/library.ts:782:19
-       let changed = false;
+       let changed = true;

[NoCoverage] ConditionalExpression
src/library.ts:784:9
-       if (costEntry && !resultEntry) {
+       if (true) {

[NoCoverage] LogicalOperator
src/library.ts:784:9
-       if (costEntry && !resultEntry) {
+       if (costEntry || !resultEntry) {

[NoCoverage] BooleanLiteral
src/library.ts:784:22
-       if (costEntry && !resultEntry) {
+       if (costEntry && resultEntry) {

[NoCoverage] BlockStatement
src/library.ts:784:36
-       if (costEntry && !resultEntry) {
-           const costValue = getTrustedItemValue(item1Name, values);
-           if (costValue !== undefined) {
-               const pricePerResult = (trade.costAmount * costValue) / trade.resultAmount;
-               addValue(values, trade.resultName, pricePerResult, 'buy', trade.x, trade.y, trade.z);
-               changed = true;
-           }
-       }
+       if (costEntry && !resultEntry) {}

[NoCoverage] BlockStatement
src/library.ts:786:38
-           if (costValue !== undefined) {
-               const pricePerResult = (trade.costAmount * costValue) / trade.resultAmount;
-               addValue(values, trade.resultName, pricePerResult, 'buy', trade.x, trade.y, trade.z);
-               changed = true;
-           }
+           if (costValue !== undefined) {}

[NoCoverage] ArithmeticOperator
src/library.ts:787:36
-               const pricePerResult = (trade.costAmount * costValue) / trade.resultAmount;
+               const pricePerResult = trade.costAmount * costValue * trade.resultAmount;

[NoCoverage] ArithmeticOperator
src/library.ts:787:37
-               const pricePerResult = (trade.costAmount * costValue) / trade.resultAmount;
+               const pricePerResult = (trade.costAmount / costValue) / trade.resultAmount;

[NoCoverage] BooleanLiteral
src/library.ts:789:23
-               changed = true;
+               changed = false;

[NoCoverage] ConditionalExpression
src/library.ts:793:9
-       if (resultEntry && !costEntry) {
+       if (true) {

[NoCoverage] LogicalOperator
src/library.ts:793:9
-       if (resultEntry && !costEntry) {
+       if (resultEntry || !costEntry) {

[NoCoverage] BooleanLiteral
src/library.ts:793:24
-       if (resultEntry && !costEntry) {
+       if (resultEntry && costEntry) {

[NoCoverage] BlockStatement
src/library.ts:793:36
-       if (resultEntry && !costEntry) {
-           const resultValue = getTrustedItemValue(trade.resultName, values);
-           if (resultValue !== undefined) {
-               const pricePerCost = (trade.resultAmount * resultValue) / trade.costAmount;
-               addValue(values, item1Name, pricePerCost, 'sell', trade.x, trade.y, trade.z);
-               changed = true;
-           }
-       }
+       if (resultEntry && !costEntry) {}

[NoCoverage] BlockStatement
src/library.ts:795:40
-           if (resultValue !== undefined) {
-               const pricePerCost = (trade.resultAmount * resultValue) / trade.costAmount;
-               addValue(values, item1Name, pricePerCost, 'sell', trade.x, trade.y, trade.z);
-               changed = true;
-           }
+           if (resultValue !== undefined) {}

[NoCoverage] ArithmeticOperator
src/library.ts:796:34
-               const pricePerCost = (trade.resultAmount * resultValue) / trade.costAmount;
+               const pricePerCost = trade.resultAmount * resultValue * trade.costAmount;

[NoCoverage] ArithmeticOperator
src/library.ts:796:35
-               const pricePerCost = (trade.resultAmount * resultValue) / trade.costAmount;
+               const pricePerCost = (trade.resultAmount / resultValue) / trade.costAmount;

[NoCoverage] BooleanLiteral
src/library.ts:798:23
-               changed = true;
+               changed = false;

[NoCoverage] BooleanLiteral
src/library.ts:810:32
-       if (!trade.item2) { return false; }
+       if (!trade.item2) { return true; }

[NoCoverage] LogicalOperator
src/library.ts:812:23
-       const item1Name = trade.item1Name ?? trade.costName;
+       const item1Name = trade.item1Name && trade.costName;

[NoCoverage] MethodExpression
src/library.ts:814:23
-       const resultKey = trade.resultName.toLowerCase();
+       const resultKey = trade.resultName.toUpperCase();

[NoCoverage] ConditionalExpression
src/library.ts:821:9
-       if ((item1IsBase && item2IsBase) || resultIsBase) { return false; }
+       if (false) { return false; }

[NoCoverage] LogicalOperator
src/library.ts:821:9
-       if ((item1IsBase && item2IsBase) || resultIsBase) { return false; }
+       if (item1IsBase && item2IsBase && resultIsBase) { return false; }

[NoCoverage] ConditionalExpression
src/library.ts:821:10
-       if ((item1IsBase && item2IsBase) || resultIsBase) { return false; }
+       if ((false) || resultIsBase) { return false; }

[NoCoverage] LogicalOperator
src/library.ts:821:10
-       if ((item1IsBase && item2IsBase) || resultIsBase) { return false; }
+       if ((item1IsBase || item2IsBase) || resultIsBase) { return false; }

[NoCoverage] BlockStatement
src/library.ts:821:55
-       if ((item1IsBase && item2IsBase) || resultIsBase) { return false; }
+       if ((item1IsBase && item2IsBase) || resultIsBase) {}

[NoCoverage] BooleanLiteral
src/library.ts:821:64
-       if ((item1IsBase && item2IsBase) || resultIsBase) { return false; }
+       if ((item1IsBase && item2IsBase) || resultIsBase) { return true; }

[NoCoverage] BooleanLiteral
src/library.ts:828:65
-       if (item1Value !== undefined && item2Value !== undefined && !resultEntry) {
+       if (item1Value !== undefined && item2Value !== undefined && resultEntry) {

[NoCoverage] BlockStatement
src/library.ts:828:79
-       if (item1Value !== undefined && item2Value !== undefined && !resultEntry) {
-           const totalCostValue = (trade.costAmount * item1Value) + (trade.item2.amount * item2Value);
-           const pricePerResult = totalCostValue / trade.resultAmount;
-           addValue(values, trade.resultName, pricePerResult, 'buy', trade.x, trade.y, trade.z);
-           return true;
-       }
+       if (item1Value !== undefined && item2Value !== undefined && !resultEntry) {}

[NoCoverage] ArithmeticOperator
src/library.ts:829:32
-           const totalCostValue = (trade.costAmount * item1Value) + (trade.item2.amount * item2Value);
+           const totalCostValue = trade.costAmount * item1Value - trade.item2.amount * item2Value;

[NoCoverage] ArithmeticOperator
src/library.ts:829:33
-           const totalCostValue = (trade.costAmount * item1Value) + (trade.item2.amount * item2Value);
+           const totalCostValue = (trade.costAmount / item1Value) + (trade.item2.amount * item2Value);

[NoCoverage] ArithmeticOperator
src/library.ts:829:67
-           const totalCostValue = (trade.costAmount * item1Value) + (trade.item2.amount * item2Value);
+           const totalCostValue = (trade.costAmount * item1Value) + (trade.item2.amount / item2Value);

[NoCoverage] ArithmeticOperator
src/library.ts:830:32
-           const pricePerResult = totalCostValue / trade.resultAmount;
+           const pricePerResult = totalCostValue * trade.resultAmount;

[NoCoverage] BooleanLiteral
src/library.ts:832:16
-           return true;
+           return false;

[NoCoverage] BooleanLiteral
src/library.ts:835:12
-       return false;
+       return true;

[Survived] BooleanLiteral
src/library.ts:860:19
-       let changed = true;
+       let changed = false;
Tests ran:
    calculateItemValues calculates buy prices from emerald trades
    calculateItemValues calculates sell prices
    calculateItemValues handles emerald block as 9 emeralds

[Survived] ConditionalExpression
src/library.ts:863:12
-       while (changed && iterations < config.analysis.maxTransitiveIterations) {
+       while (false) {
Tests ran:
    calculateItemValues calculates buy prices from emerald trades
    calculateItemValues calculates sell prices
    calculateItemValues handles emerald block as 9 emeralds

[Survived] LogicalOperator
src/library.ts:863:12
-       while (changed && iterations < config.analysis.maxTransitiveIterations) {
+       while (changed || iterations < config.analysis.maxTransitiveIterations) {
Tests ran:
    calculateItemValues calculates buy prices from emerald trades
    calculateItemValues calculates sell prices
    calculateItemValues handles emerald block as 9 emeralds

[Survived] ConditionalExpression
src/library.ts:863:23
-       while (changed && iterations < config.analysis.maxTransitiveIterations) {
+       while (changed && true) {
Tests ran:
    calculateItemValues calculates buy prices from emerald trades
    calculateItemValues calculates sell prices
    calculateItemValues handles emerald block as 9 emeralds

[Survived] EqualityOperator
src/library.ts:863:23
-       while (changed && iterations < config.analysis.maxTransitiveIterations) {
+       while (changed && iterations <= config.analysis.maxTransitiveIterations) {
Tests ran:
    calculateItemValues calculates buy prices from emerald trades
    calculateItemValues calculates sell prices
    calculateItemValues handles emerald block as 9 emeralds

[Survived] EqualityOperator
src/library.ts:863:23
-       while (changed && iterations < config.analysis.maxTransitiveIterations) {
+       while (changed && iterations >= config.analysis.maxTransitiveIterations) {
Tests ran:
    calculateItemValues calculates buy prices from emerald trades
    calculateItemValues calculates sell prices
    calculateItemValues handles emerald block as 9 emeralds

[Survived] BooleanLiteral
src/library.ts:864:19
-           changed = false;
+           changed = true;
Tests ran:
    calculateItemValues calculates buy prices from emerald trades
    calculateItemValues calculates sell prices
    calculateItemValues handles emerald block as 9 emeralds

[Survived] UpdateOperator
src/library.ts:865:9
-           iterations++;
+           iterations--;
Tests ran:
    calculateItemValues calculates buy prices from emerald trades
    calculateItemValues calculates sell prices
    calculateItemValues handles emerald block as 9 emeralds

[NoCoverage] BooleanLiteral
src/library.ts:869:27
-                   changed = true;
+                   changed = false;

[Survived] ConditionalExpression
src/library.ts:917:9
-       if (priceArray.length === 0) { return 0; }
+       if (false) { return 0; }
Tests ran:
    countIndependentShops counts distant shops as independent
    countIndependentShops clusters nearby shops
    countIndependentShops returns 0 for empty array
  and 4 more tests!

[Survived] BlockStatement
src/library.ts:917:34
-       if (priceArray.length === 0) { return 0; }
+       if (priceArray.length === 0) {}
Tests ran:
    countIndependentShops returns 0 for empty array
    hasEnoughIndependentData returns true when enough independent shops
    hasEnoughIndependentData returns false when not enough independent shops
  and 1 more test!

[Survived] ConditionalExpression
src/library.ts:921:9
-       if (locations.length === 0) { return priceArray.length; }
+       if (false) { return priceArray.length; }
Tests ran:
    countIndependentShops counts distant shops as independent
    countIndependentShops clusters nearby shops
    hasEnoughIndependentData returns true when enough independent shops
  and 3 more tests!

[NoCoverage] BlockStatement
src/library.ts:921:33
-       if (locations.length === 0) { return priceArray.length; }
+       if (locations.length === 0) {}

[Survived] ArithmeticOperator
src/library.ts:927:45
-               const distribution = Math.hypot(loc.x - cluster.x, loc.y - cluster.y, loc.z - cluster.z);
+               const distribution = Math.hypot(loc.x + cluster.x, loc.y - cluster.y, loc.z - cluster.z);
Tests ran:
    countIndependentShops counts distant shops as independent
    countIndependentShops clusters nearby shops
    hasEnoughIndependentData returns true when enough independent shops
  and 3 more tests!

[Survived] ArithmeticOperator
src/library.ts:927:83
-               const distribution = Math.hypot(loc.x - cluster.x, loc.y - cluster.y, loc.z - cluster.z);
+               const distribution = Math.hypot(loc.x - cluster.x, loc.y - cluster.y, loc.z + cluster.z);
Tests ran:
    countIndependentShops counts distant shops as independent
    countIndependentShops clusters nearby shops
    hasEnoughIndependentData returns true when enough independent shops
  and 3 more tests!

[Survived] EqualityOperator
src/library.ts:928:17
-               if (distribution <= config.analysis.shopClusterDistance) {
+               if (distribution < config.analysis.shopClusterDistance) {
Tests ran:
    countIndependentShops counts distant shops as independent
    countIndependentShops clusters nearby shops
    hasEnoughIndependentData returns true when enough independent shops
  and 3 more tests!

[Survived] LogicalOperator
src/library.ts:979:9
-       if (isCoreBlock && !hasEnoughIndependentData(entry, minShops)) { return undefined; }
+       if (isCoreBlock || !hasEnoughIndependentData(entry, minShops)) { return undefined; }
Tests ran:
    getTrustedItemValue returns median for trusted item
    getTrustedItemValue - advanced cases uses average of buy and sell when both available
    getTrustedItemValue - advanced cases uses sell price when buy unavailable
  and 1 more test!

[Survived] MethodExpression
src/library.ts:993:38
-       const baseEntry = itemValues.get(blockInfo.base.toLowerCase());
+       const baseEntry = itemValues.get(blockInfo.base.toUpperCase());
Tests ran:
    getTrustedItemValue - advanced cases core block requires min independent shops

[NoCoverage] ConditionalExpression
src/library.ts:995:9
-       if (isCoreBlock && !hasEnoughIndependentData(baseEntry, minShops)) { return undefined; }
+       if (false) { return undefined; }

[NoCoverage] LogicalOperator
src/library.ts:995:9
-       if (isCoreBlock && !hasEnoughIndependentData(baseEntry, minShops)) { return undefined; }
+       if (isCoreBlock || !hasEnoughIndependentData(baseEntry, minShops)) { return undefined; }

[NoCoverage] BooleanLiteral
src/library.ts:995:24
-       if (isCoreBlock && !hasEnoughIndependentData(baseEntry, minShops)) { return undefined; }
+       if (isCoreBlock && hasEnoughIndependentData(baseEntry, minShops)) { return undefined; }

[NoCoverage] BlockStatement
src/library.ts:995:72
-       if (isCoreBlock && !hasEnoughIndependentData(baseEntry, minShops)) { return undefined; }
+       if (isCoreBlock && !hasEnoughIndependentData(baseEntry, minShops)) {}

[NoCoverage] ArithmeticOperator
src/library.ts:999:12
-       return baseValue * blockInfo.multiplier;
+       return baseValue / blockInfo.multiplier;

[Survived] ConditionalExpression
src/library.ts:1010:13
-           if (conversion.base.toLowerCase() !== itemKey) { continue; }
+           if (false) { continue; }
Tests ran:
    getTrustedItemValue - advanced cases returns null for unknown item
    getTrustedItemValue - advanced cases falls back to block conversion for core block ingot
    getTrustedItemValue - advanced cases core block requires min independent shops

[Survived] BlockStatement
src/library.ts:1010:56
-           if (conversion.base.toLowerCase() !== itemKey) { continue; }
+           if (conversion.base.toLowerCase() !== itemKey) {}
Tests ran:
    getTrustedItemValue - advanced cases returns null for unknown item
    getTrustedItemValue - advanced cases falls back to block conversion for core block ingot
    getTrustedItemValue - advanced cases core block requires min independent shops

[Survived] ConditionalExpression
src/library.ts:1014:13
-           if (isCoreBlock && !hasEnoughIndependentData(blockEntry, minShops)) { continue; }
+           if (false) { continue; }
Tests ran:
    getTrustedItemValue - advanced cases falls back to block conversion for core block ingot

[Survived] LogicalOperator
src/library.ts:1014:13
-           if (isCoreBlock && !hasEnoughIndependentData(blockEntry, minShops)) { continue; }
+           if (isCoreBlock || !hasEnoughIndependentData(blockEntry, minShops)) { continue; }
Tests ran:
    getTrustedItemValue - advanced cases falls back to block conversion for core block ingot

[NoCoverage] BooleanLiteral
src/library.ts:1014:28
-           if (isCoreBlock && !hasEnoughIndependentData(blockEntry, minShops)) { continue; }
+           if (isCoreBlock && hasEnoughIndependentData(blockEntry, minShops)) { continue; }

[NoCoverage] BlockStatement
src/library.ts:1014:77
-           if (isCoreBlock && !hasEnoughIndependentData(blockEntry, minShops)) { continue; }
+           if (isCoreBlock && !hasEnoughIndependentData(blockEntry, minShops)) {}

[Survived] ConditionalExpression
src/library.ts:1061:9
-       if (conversionValue !== undefined) { return conversionValue; }
+       if (false) { return conversionValue; }
Tests ran:
    getTrustedItemValue - advanced cases returns null for unknown item
    getTrustedItemValue - advanced cases falls back to block conversion for core block ingot
    getTrustedItemValue - advanced cases core block requires min independent shops

[NoCoverage] BlockStatement
src/library.ts:1061:40
-       if (conversionValue !== undefined) { return conversionValue; }
+       if (conversionValue !== undefined) {}

[Survived] ConditionalExpression
src/library.ts:1144:9
-       if (previousWorld === currentWorld) {
+       if (false) {
Tests ran:
    shouldSwitchMapWorld returns false when player stayed in same world
    shouldSwitchMapWorld returns false when map already shows player world
    shouldSwitchMapWorld returns false when no shops in player new world
  and 6 more tests!

[Survived] BlockStatement
src/library.ts:1144:41
-       if (previousWorld === currentWorld) {
-           return false;
-       }
+       if (previousWorld === currentWorld) {}
Tests ran:
    shouldSwitchMapWorld returns false when player stayed in same world

[NoCoverage] MethodExpression
src/library.ts:1356:26
-       const isStopNether = stopWorld.toLowerCase().includes('nether');
+       const isStopNether = stopWorld.toUpperCase().includes('nether');

[NoCoverage] StringLiteral
src/library.ts:1356:59
-       const isStopNether = stopWorld.toLowerCase().includes('nether');
+       const isStopNether = stopWorld.toLowerCase().includes("");

[NoCoverage] MethodExpression
src/library.ts:1357:26
-       const isViewNether = viewWorld.toLowerCase().includes('nether');
+       const isViewNether = viewWorld.toUpperCase().includes('nether');

[NoCoverage] StringLiteral
src/library.ts:1357:59
-       const isViewNether = viewWorld.toLowerCase().includes('nether');
+       const isViewNether = viewWorld.toLowerCase().includes("");

[NoCoverage] ConditionalExpression
src/library.ts:1359:9
-       if (isStopNether === isViewNether) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/library.ts:1359:9
-       if (isStopNether === isViewNether) {
+       if (false) {

[NoCoverage] EqualityOperator
src/library.ts:1359:9
-       if (isStopNether === isViewNether) {
+       if (isStopNether !== isViewNether) {

[NoCoverage] BlockStatement
src/library.ts:1359:40
-       if (isStopNether === isViewNether) {
-           // Same world type: no conversion needed
-           return { x, z };
-       }
+       if (isStopNether === isViewNether) {}

[NoCoverage] ConditionalExpression
src/library.ts:1364:9
-       if (isStopNether && !isViewNether) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/library.ts:1364:9
-       if (isStopNether && !isViewNether) {
+       if (false) {

[NoCoverage] LogicalOperator
src/library.ts:1364:9
-       if (isStopNether && !isViewNether) {
+       if (isStopNether || !isViewNether) {

[NoCoverage] BooleanLiteral
src/library.ts:1364:25
-       if (isStopNether && !isViewNether) {
+       if (isStopNether && isViewNether) {

[NoCoverage] BlockStatement
src/library.ts:1364:40
-       if (isStopNether && !isViewNether) {
-           // Nether stop, viewing overworld: scale up ├ù8
-           return { x: x * 8, z: z * 8 };
-       }
+       if (isStopNether && !isViewNether) {}

[NoCoverage] ArithmeticOperator
src/library.ts:1366:21
-           return { x: x * 8, z: z * 8 };
+           return { x: x / 8, z: z * 8 };

[NoCoverage] ArithmeticOperator
src/library.ts:1366:31
-           return { x: x * 8, z: z * 8 };
+           return { x: x * 8, z: z / 8 };

[NoCoverage] ArithmeticOperator
src/library.ts:1370:17
-       return { x: x / 8, z: z / 8 };
+       return { x: x * 8, z: z / 8 };

[NoCoverage] ArithmeticOperator
src/library.ts:1370:27
-       return { x: x / 8, z: z / 8 };
+       return { x: x / 8, z: z * 8 };

[Survived] StringLiteral
src/library.ts:1421:42
-       const originWorld = origin?.world ?? 'overworld';
+       const originWorld = origin?.world ?? "";
Tests ran:
    nearestNeighborOrder properties output is a valid permutation of indices
    nearestNeighborOrder properties empty input returns empty output
    nearestNeighborOrder properties single point returns [0]
  and 31 more tests!

[Survived] EqualityOperator
src/library.ts:1432:25
-       for (let index = 0; index < points.length; index++) {
+       for (let index = 0; index <= points.length; index++) {
Tests ran:
    nearestNeighborOrder properties output is a valid permutation of indices
    nearestNeighborOrder properties empty input returns empty output
    nearestNeighborOrder properties single point returns [0]
  and 36 more tests!

[Survived] ConditionalExpression
src/library.ts:1458:9
-       if (points.length === 0) {return [];}
+       if (false) {return [];}
Tests ran:
    nearestNeighborOrder properties output is a valid permutation of indices
    nearestNeighborOrder properties empty input returns empty output
    nearestNeighborOrder properties single point returns [0]
  and 17 more tests!

[Survived] BlockStatement
src/library.ts:1458:30
-       if (points.length === 0) {return [];}
+       if (points.length === 0) {}
Tests ran:
    nearestNeighborOrder properties empty input returns empty output
    twoOptOptimize properties small inputs returned unchanged (< 3 elements)
    nearestNeighborOrder returns empty array for empty points

[Survived] ConditionalExpression
src/library.ts:1459:9
-       if (points.length === 1) {return [0];}
+       if (false) {return [0];}
Tests ran:
    nearestNeighborOrder properties output is a valid permutation of indices
    nearestNeighborOrder properties single point returns [0]
    twoOptOptimize properties output distance is less than or equal to input distance
  and 15 more tests!

[Survived] BlockStatement
src/library.ts:1459:30
-       if (points.length === 1) {return [0];}
+       if (points.length === 1) {}
Tests ran:
    nearestNeighborOrder properties output is a valid permutation of indices
    nearestNeighborOrder properties single point returns [0]
    twoOptOptimize properties small inputs returned unchanged (< 3 elements)
  and 2 more tests!

[Survived] UnaryOperator
src/library.ts:1466:28
-           let nearestIndex = -1;
+           let nearestIndex = +1;
Tests ran:
    nearestNeighborOrder properties output is a valid permutation of indices
    twoOptOptimize properties output distance is less than or equal to input distance
    twoOptOptimize properties output is a valid permutation of input
  and 13 more tests!

[Survived] EqualityOperator
src/library.ts:1469:29
-           for (let index = 0; index < points.length; index++) {
+           for (let index = 0; index <= points.length; index++) {
Tests ran:
    nearestNeighborOrder properties output is a valid permutation of indices
    twoOptOptimize properties output distance is less than or equal to input distance
    twoOptOptimize properties output is a valid permutation of input
  and 13 more tests!

[Survived] EqualityOperator
src/library.ts:1472:17
-               if (distribution < nearestDistribution) {
+               if (distribution <= nearestDistribution) {
Tests ran:
    nearestNeighborOrder properties output is a valid permutation of indices
    twoOptOptimize properties output distance is less than or equal to input distance
    twoOptOptimize properties output is a valid permutation of input
  and 13 more tests!

[Survived] ConditionalExpression
src/library.ts:1478:13
-           if (nearestIndex !== -1) {
+           if (true) {
Tests ran:
    nearestNeighborOrder properties output is a valid permutation of indices
    twoOptOptimize properties output distance is less than or equal to input distance
    twoOptOptimize properties output is a valid permutation of input
  and 13 more tests!

[Survived] ConditionalExpression
src/library.ts:1523:20
-           previousI: startIndex === 0 ? 0 : result[startIndex - 1]! + 1,
+           previousI: true ? 0 : result[startIndex - 1]! + 1,
Tests ran:
    twoOptOptimize properties output distance is less than or equal to input distance
    twoOptOptimize properties output is a valid permutation of input
    twoOptOptimize properties optimization is idempotent
  and 7 more tests!

[Survived] ConditionalExpression
src/library.ts:1526:16
-           nextJ: endIndex === result.length - 1 ? -1 : result[endIndex + 1]! + 1
+           nextJ: true ? -1 : result[endIndex + 1]! + 1
Tests ran:
    twoOptOptimize properties output distance is less than or equal to input distance
    twoOptOptimize properties output is a valid permutation of input
    twoOptOptimize properties optimization is idempotent
  and 7 more tests!

[Survived] ConditionalExpression
src/library.ts:1526:16
-           nextJ: endIndex === result.length - 1 ? -1 : result[endIndex + 1]! + 1
+           nextJ: false ? -1 : result[endIndex + 1]! + 1
Tests ran:
    twoOptOptimize properties output distance is less than or equal to input distance
    twoOptOptimize properties output is a valid permutation of input
    twoOptOptimize properties optimization is idempotent
  and 7 more tests!

[Survived] EqualityOperator
src/library.ts:1526:16
-           nextJ: endIndex === result.length - 1 ? -1 : result[endIndex + 1]! + 1
+           nextJ: endIndex !== result.length - 1 ? -1 : result[endIndex + 1]! + 1
Tests ran:
    twoOptOptimize properties output distance is less than or equal to input distance
    twoOptOptimize properties output is a valid permutation of input
    twoOptOptimize properties optimization is idempotent
  and 7 more tests!

[Survived] ArithmeticOperator
src/library.ts:1526:29
-           nextJ: endIndex === result.length - 1 ? -1 : result[endIndex + 1]! + 1
+           nextJ: endIndex === result.length + 1 ? -1 : result[endIndex + 1]! + 1
Tests ran:
    twoOptOptimize properties output distance is less than or equal to input distance
    twoOptOptimize properties output is a valid permutation of input
    twoOptOptimize properties optimization is idempotent
  and 7 more tests!

[Survived] ConditionalExpression
src/library.ts:1538:9
-       if (nextJ !== -1) {
+       if (true) {
Tests ran:
    twoOptOptimize properties output distance is less than or equal to input distance
    twoOptOptimize properties output is a valid permutation of input
    twoOptOptimize properties optimization is idempotent
  and 7 more tests!

[Survived] ConditionalExpression
src/library.ts:1538:9
-       if (nextJ !== -1) {
+       if (false) {
Tests ran:
    twoOptOptimize properties output distance is less than or equal to input distance
    twoOptOptimize properties output is a valid permutation of input
    twoOptOptimize properties optimization is idempotent
  and 7 more tests!

[Survived] EqualityOperator
src/library.ts:1538:9
-       if (nextJ !== -1) {
+       if (nextJ === -1) {
Tests ran:
    twoOptOptimize properties output distance is less than or equal to input distance
    twoOptOptimize properties output is a valid permutation of input
    twoOptOptimize properties optimization is idempotent
  and 7 more tests!
