[Survived] UnaryOperator
src/library.ts:1538:19
-       if (nextJ !== -1) {
+       if (nextJ !== +1) {
Tests ran:
    twoOptOptimize properties output distance is less than or equal to input distance
    twoOptOptimize properties output is a valid permutation of input
    twoOptOptimize properties optimization is idempotent
  and 7 more tests!

[Survived] BlockStatement
src/library.ts:1538:23
-       if (nextJ !== -1) {
-           currentCost += distributionMatrix[currentJ]![nextJ]!;
-       }
+       if (nextJ !== -1) {}
Tests ran:
    twoOptOptimize properties output distance is less than or equal to input distance
    twoOptOptimize properties output is a valid permutation of input
    twoOptOptimize properties optimization is idempotent
  and 2 more tests!

[Survived] AssignmentOperator
src/library.ts:1539:9
-           currentCost += distributionMatrix[currentJ]![nextJ]!;
+           currentCost -= distributionMatrix[currentJ]![nextJ]!;
Tests ran:
    twoOptOptimize properties output distance is less than or equal to input distance
    twoOptOptimize properties output is a valid permutation of input
    twoOptOptimize properties optimization is idempotent
  and 2 more tests!

[Survived] ConditionalExpression
src/library.ts:1544:9
-       if (nextJ !== -1) {
+       if (true) {
Tests ran:
    twoOptOptimize properties output distance is less than or equal to input distance
    twoOptOptimize properties output is a valid permutation of input
    twoOptOptimize properties optimization is idempotent
  and 7 more tests!

[Survived] ConditionalExpression
src/library.ts:1548:12
-       return newCost < currentCost - 0.001;
+       return false;
Tests ran:
    twoOptOptimize properties output distance is less than or equal to input distance
    twoOptOptimize properties output is a valid permutation of input
    twoOptOptimize properties optimization is idempotent
  and 7 more tests!

[Survived] EqualityOperator
src/library.ts:1548:12
-       return newCost < currentCost - 0.001;
+       return newCost <= currentCost - 0.001;
Tests ran:
    twoOptOptimize properties output distance is less than or equal to input distance
    twoOptOptimize properties output is a valid permutation of input
    twoOptOptimize properties optimization is idempotent
  and 7 more tests!

[Survived] ConditionalExpression
src/library.ts:1575:9
-       if (order.length < 3) {return [...order];}
+       if (true) {return [...order];}
Tests ran:
    twoOptOptimize properties output distance is less than or equal to input distance
    twoOptOptimize properties output is a valid permutation of input
    twoOptOptimize properties small inputs returned unchanged (< 3 elements)
  and 12 more tests!

[Survived] ConditionalExpression
src/library.ts:1575:9
-       if (order.length < 3) {return [...order];}
+       if (false) {return [...order];}
Tests ran:
    twoOptOptimize properties output distance is less than or equal to input distance
    twoOptOptimize properties output is a valid permutation of input
    twoOptOptimize properties small inputs returned unchanged (< 3 elements)
  and 12 more tests!

[Survived] EqualityOperator
src/library.ts:1575:9
-       if (order.length < 3) {return [...order];}
+       if (order.length <= 3) {return [...order];}
Tests ran:
    twoOptOptimize properties output distance is less than or equal to input distance
    twoOptOptimize properties output is a valid permutation of input
    twoOptOptimize properties small inputs returned unchanged (< 3 elements)
  and 12 more tests!

[Survived] EqualityOperator
src/library.ts:1575:9
-       if (order.length < 3) {return [...order];}
+       if (order.length >= 3) {return [...order];}
Tests ran:
    twoOptOptimize properties output distance is less than or equal to input distance
    twoOptOptimize properties output is a valid permutation of input
    twoOptOptimize properties small inputs returned unchanged (< 3 elements)
  and 12 more tests!

[Survived] BlockStatement
src/library.ts:1575:27
-       if (order.length < 3) {return [...order];}
+       if (order.length < 3) {}
Tests ran:
    twoOptOptimize properties small inputs returned unchanged (< 3 elements)
    twoOptOptimize returns copy for orders with less than 3 points
    computeOptimalOrder handles mixed overworld and nether points
  and 2 more tests!

[Survived] BooleanLiteral
src/library.ts:1578:20
-       let improved = true;
+       let improved = false;
Tests ran:
    twoOptOptimize properties output distance is less than or equal to input distance
    twoOptOptimize properties output is a valid permutation of input
    twoOptOptimize properties optimization is idempotent
  and 7 more tests!

[Survived] ConditionalExpression
src/library.ts:1580:12
-       while (improved) {
+       while (false) {
Tests ran:
    twoOptOptimize properties output distance is less than or equal to input distance
    twoOptOptimize properties output is a valid permutation of input
    twoOptOptimize properties optimization is idempotent
  and 7 more tests!

[Survived] ConditionalExpression
src/library.ts:1583:34
-           for (let startIndex = 0; startIndex < result.length - 1; startIndex++) {
+           for (let startIndex = 0; false; startIndex++) {
Tests ran:
    twoOptOptimize properties output distance is less than or equal to input distance
    twoOptOptimize properties output is a valid permutation of input
    twoOptOptimize properties optimization is idempotent
  and 7 more tests!

[Survived] EqualityOperator
src/library.ts:1583:34
-           for (let startIndex = 0; startIndex < result.length - 1; startIndex++) {
+           for (let startIndex = 0; startIndex <= result.length - 1; startIndex++) {
Tests ran:
    twoOptOptimize properties output distance is less than or equal to input distance
    twoOptOptimize properties output is a valid permutation of input
    twoOptOptimize properties optimization is idempotent
  and 7 more tests!

[Survived] EqualityOperator
src/library.ts:1583:34
-           for (let startIndex = 0; startIndex < result.length - 1; startIndex++) {
+           for (let startIndex = 0; startIndex >= result.length - 1; startIndex++) {
Tests ran:
    twoOptOptimize properties output distance is less than or equal to input distance
    twoOptOptimize properties output is a valid permutation of input
    twoOptOptimize properties optimization is idempotent
  and 7 more tests!

[Survived] ArithmeticOperator
src/library.ts:1583:47
-           for (let startIndex = 0; startIndex < result.length - 1; startIndex++) {
+           for (let startIndex = 0; startIndex < result.length + 1; startIndex++) {
Tests ran:
    twoOptOptimize properties output distance is less than or equal to input distance
    twoOptOptimize properties output is a valid permutation of input
    twoOptOptimize properties optimization is idempotent
  and 7 more tests!

[Survived] BlockStatement
src/library.ts:1583:80
-           for (let startIndex = 0; startIndex < result.length - 1; startIndex++) {
-               for (let endIndex = startIndex + 2; endIndex < result.length; endIndex++) {
-                   const indices = calculateEdgeIndices(result, startIndex, endIndex);
-                   
-                   if (shouldSwapEdges(distributionMatrix, indices)) {
-                       applyTwoOptSwap(result, startIndex, endIndex);
-                       improved = true;
-                   }
-               }
-           }
+           for (let startIndex = 0; startIndex < result.length - 1; startIndex++) {}
Tests ran:
    twoOptOptimize properties output distance is less than or equal to input distance
    twoOptOptimize properties output is a valid permutation of input
    twoOptOptimize properties optimization is idempotent
  and 7 more tests!

[Survived] ConditionalExpression
src/library.ts:1584:49
-               for (let endIndex = startIndex + 2; endIndex < result.length; endIndex++) {
+               for (let endIndex = startIndex + 2; false; endIndex++) {
Tests ran:
    twoOptOptimize properties output distance is less than or equal to input distance
    twoOptOptimize properties output is a valid permutation of input
    twoOptOptimize properties optimization is idempotent
  and 7 more tests!

[Survived] BlockStatement
src/library.ts:1584:87
-               for (let endIndex = startIndex + 2; endIndex < result.length; endIndex++) {
-                   const indices = calculateEdgeIndices(result, startIndex, endIndex);
-                   
-                   if (shouldSwapEdges(distributionMatrix, indices)) {
-                       applyTwoOptSwap(result, startIndex, endIndex);
-                       improved = true;
-                   }
-               }
+               for (let endIndex = startIndex + 2; endIndex < result.length; endIndex++) {}
Tests ran:
    twoOptOptimize properties output distance is less than or equal to input distance
    twoOptOptimize properties output is a valid permutation of input
    twoOptOptimize properties optimization is idempotent
  and 7 more tests!

[Survived] ConditionalExpression
src/library.ts:1587:21
-                   if (shouldSwapEdges(distributionMatrix, indices)) {
+                   if (false) {
Tests ran:
    twoOptOptimize properties output distance is less than or equal to input distance
    twoOptOptimize properties output is a valid permutation of input
    twoOptOptimize properties optimization is idempotent
  and 7 more tests!

[Survived] BlockStatement
src/library.ts:1587:67
-                   if (shouldSwapEdges(distributionMatrix, indices)) {
-                       applyTwoOptSwap(result, startIndex, endIndex);
-                       improved = true;
-                   }
+                   if (shouldSwapEdges(distributionMatrix, indices)) {}
Tests ran:
    twoOptOptimize properties output distance is less than or equal to input distance
    twoOptOptimize properties output is a valid permutation of input
    twoOptOptimize improves crossed path

[Survived] BooleanLiteral
src/library.ts:1589:32
-                       improved = true;
+                       improved = false;
Tests ran:
    twoOptOptimize properties output distance is less than or equal to input distance
    twoOptOptimize properties output is a valid permutation of input
    twoOptOptimize improves crossed path

[Survived] ConditionalExpression
src/library.ts:1612:9
-       if (points.length === 0) {return [];}
+       if (false) {return [];}
Tests ran:
    computeOptimalOrder returns empty array for empty points
    computeOptimalOrder returns [0] for single point
    computeOptimalOrder returns optimal order for simple case
  and 6 more tests!

[Survived] BlockStatement
src/library.ts:1612:30
-       if (points.length === 0) {return [];}
+       if (points.length === 0) {}
Tests ran:
    computeOptimalOrder returns empty array for empty points

[Survived] ConditionalExpression
src/library.ts:1613:9
-       if (points.length === 1) {return [0];}
+       if (false) {return [0];}
Tests ran:
    computeOptimalOrder returns [0] for single point
    computeOptimalOrder returns optimal order for simple case
    computeOptimalOrder optimizes crossed path
  and 5 more tests!

[Survived] BlockStatement
src/library.ts:1613:30
-       if (points.length === 1) {return [0];}
+       if (points.length === 1) {}
Tests ran:
    computeOptimalOrder returns [0] for single point

[Survived] StringLiteral
src/library.ts:1685:18
-       startWorld = 'overworld'
+       startWorld = ""
Tests ran:
    calculateTotalRouteDistance returns 0 for empty route
    calculateTotalRouteDistance calculates distance from origin to single stop
    calculateTotalRouteDistance calculates distance through multiple stops

[Survived] ConditionalExpression
src/library.ts:1687:9
-       if (route.length === 0) { return 0; }
+       if (false) { return 0; }
Tests ran:
    calculateTotalRouteDistance returns 0 for empty route
    calculateTotalRouteDistance calculates distance from origin to single stop
    calculateTotalRouteDistance calculates distance through multiple stops
  and 2 more tests!

[Survived] BlockStatement
src/library.ts:1687:29
-       if (route.length === 0) { return 0; }
+       if (route.length === 0) {}
Tests ran:
    calculateTotalRouteDistance returns 0 for empty route

[NoCoverage] BooleanLiteral
src/library.ts:1806:29
-       if (!previous) { return true; }
+       if (!previous) { return false; }

[NoCoverage] ConditionalExpression
src/library.ts:1807:12
-       return Math.abs(previous.x - current.x) > threshold || Math.abs(previous.z - current.z) > threshold;
+       return true;

[NoCoverage] ConditionalExpression
src/library.ts:1807:12
-       return Math.abs(previous.x - current.x) > threshold || Math.abs(previous.z - current.z) > threshold;
+       return false;

[NoCoverage] LogicalOperator
src/library.ts:1807:12
-       return Math.abs(previous.x - current.x) > threshold || Math.abs(previous.z - current.z) > threshold;
+       return Math.abs(previous.x - current.x) > threshold && Math.abs(previous.z - current.z) > threshold;

[NoCoverage] ConditionalExpression
src/library.ts:1807:12
-       return Math.abs(previous.x - current.x) > threshold || Math.abs(previous.z - current.z) > threshold;
+       return false || Math.abs(previous.z - current.z) > threshold;

[NoCoverage] EqualityOperator
src/library.ts:1807:12
-       return Math.abs(previous.x - current.x) > threshold || Math.abs(previous.z - current.z) > threshold;
+       return Math.abs(previous.x - current.x) >= threshold || Math.abs(previous.z - current.z) > threshold;

[NoCoverage] EqualityOperator
src/library.ts:1807:12
-       return Math.abs(previous.x - current.x) > threshold || Math.abs(previous.z - current.z) > threshold;
+       return Math.abs(previous.x - current.x) <= threshold || Math.abs(previous.z - current.z) > threshold;

[NoCoverage] ArithmeticOperator
src/library.ts:1807:21
-       return Math.abs(previous.x - current.x) > threshold || Math.abs(previous.z - current.z) > threshold;
+       return Math.abs(previous.x + current.x) > threshold || Math.abs(previous.z - current.z) > threshold;

[NoCoverage] ConditionalExpression
src/library.ts:1807:60
-       return Math.abs(previous.x - current.x) > threshold || Math.abs(previous.z - current.z) > threshold;
+       return Math.abs(previous.x - current.x) > threshold || false;

[NoCoverage] EqualityOperator
src/library.ts:1807:60
-       return Math.abs(previous.x - current.x) > threshold || Math.abs(previous.z - current.z) > threshold;
+       return Math.abs(previous.x - current.x) > threshold || Math.abs(previous.z - current.z) >= threshold;

[NoCoverage] EqualityOperator
src/library.ts:1807:60
-       return Math.abs(previous.x - current.x) > threshold || Math.abs(previous.z - current.z) > threshold;
+       return Math.abs(previous.x - current.x) > threshold || Math.abs(previous.z - current.z) <= threshold;

[NoCoverage] ArithmeticOperator
src/library.ts:1807:69
-       return Math.abs(previous.x - current.x) > threshold || Math.abs(previous.z - current.z) > threshold;
+       return Math.abs(previous.x - current.x) > threshold || Math.abs(previous.z + current.z) > threshold;

[Survived] ConditionalExpression
src/library.ts:1854:9
-       if (dtMs <= 0) { return { vx: 0, vz: 0 }; }
+       if (false) { return { vx: 0, vz: 0 }; }
Tests ran:
    estimateVelocity calculates velocity from two positions
    estimateVelocity calculates diagonal velocity
    estimateVelocity returns zero velocity for zero time delta
  and 20 more tests!

[Survived] EqualityOperator
src/library.ts:1854:9
-       if (dtMs <= 0) { return { vx: 0, vz: 0 }; }
+       if (dtMs < 0) { return { vx: 0, vz: 0 }; }
Tests ran:
    estimateVelocity calculates velocity from two positions
    estimateVelocity calculates diagonal velocity
    estimateVelocity returns zero velocity for zero time delta
  and 20 more tests!

[Survived] BlockStatement
src/library.ts:1854:20
-       if (dtMs <= 0) { return { vx: 0, vz: 0 }; }
+       if (dtMs <= 0) {}
Tests ran:
    estimateVelocity returns zero velocity for zero time delta
    estimateVelocity returns zero velocity for negative time delta

[Survived] EqualityOperator
src/library.ts:1861:9
-       if (speed > MAX_SPEED_BLOCKS_PER_MS) {
+       if (speed >= MAX_SPEED_BLOCKS_PER_MS) {
Tests ran:
    estimateVelocity calculates velocity from two positions
    estimateVelocity calculates diagonal velocity
    estimateVelocity rejects implausible speed (teleport)
  and 18 more tests!

[Survived] EqualityOperator
src/library.ts:1956:12
-       return speed >= speedThreshold;
+       return speed > speedThreshold;
Tests ran:
    shouldExtrapolate returns false for zero velocity
    shouldExtrapolate returns false for very low speed
    shouldExtrapolate returns true when velocity matches heading (east)
  and 20 more tests!

[Survived] EqualityOperator
src/library.ts:2029:9
-       if (improvement < dropThreshold) {
+       if (improvement <= dropThreshold) {
Tests ran:
    computeDashboardData does not flag existing trades as new
    computeDashboardData detects price drops meeting threshold
    computeDashboardData ignores price changes below threshold
  and 1 more test!

[Survived] EqualityOperator
src/library.ts:2051:12
-           || deviation.percent <= favorite.maxDeviation;
+           || deviation.percent < favorite.maxDeviation;
Tests ran:
    computeDashboardData detects watchlist hits for favorited items
    computeDashboardData excludes watchlist items exceeding maxDeviation

[Survived] MethodExpression
src/library.ts:2054:28
-       const normalizedName = trade.resultName.toLowerCase();
+       const normalizedName = trade.resultName.toUpperCase();
Tests ran:
    computeDashboardData detects watchlist hits for favorited items
    computeDashboardData keeps best deal per favorite item

[Survived] ConditionalExpression
src/library.ts:2056:9
-       if (existing && deviation.percent >= existing.currentDeviation) { return; }
+       if (false) { return; }
Tests ran:
    computeDashboardData detects watchlist hits for favorited items
    computeDashboardData keeps best deal per favorite item

[Survived] EqualityOperator
src/library.ts:2056:21
-       if (existing && deviation.percent >= existing.currentDeviation) { return; }
+       if (existing && deviation.percent > existing.currentDeviation) { return; }
Tests ran:
    computeDashboardData keeps best deal per favorite item

[NoCoverage] BlockStatement
src/library.ts:2056:69
-       if (existing && deviation.percent >= existing.currentDeviation) { return; }
+       if (existing && deviation.percent >= existing.currentDeviation) {}

[Survived] ArithmeticOperator
src/library.ts:2116:31
-       priceDrops.sort((a, b) => (a.newDeviation - a.oldDeviation) - (b.newDeviation - b.oldDeviation));
+       priceDrops.sort((a, b) => a.newDeviation - a.oldDeviation + (b.newDeviation - b.oldDeviation));
Tests ran:
    computeDashboardData sorts price drops by improvement magnitude

[Survived] ArithmeticOperator
src/library.ts:2116:68
-       priceDrops.sort((a, b) => (a.newDeviation - a.oldDeviation) - (b.newDeviation - b.oldDeviation));
+       priceDrops.sort((a, b) => (a.newDeviation - a.oldDeviation) - (b.newDeviation + b.oldDeviation));
Tests ran:
    computeDashboardData sorts price drops by improvement magnitude
